# BuiltInCategory Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..BuiltInCategory Property
Category Class See Also
---
Gets the BuiltInCategory value for this category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public BuiltInCategory BuiltInCategory { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BuiltInCategory As BuiltInCategory
	Get
```

Visual C++
---
```text
public:
property BuiltInCategory BuiltInCategory {
	BuiltInCategory get ();
}
```

# ### Field Value
BuiltInCategory value for the category or INVALID if the category is not a built-in category.
# See Also
Category Class
Autodesk.Revit.DB Namespace